# Дано натуральное число. Требуется определить, является ли год с данным номером 
# високосным. Если год является високосным, то выведите YES, иначе выведите NO. 
# Напомним, что в соответствии с григорианским календарем, год является високосным,
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.
# Input: 2016
# Output: YES

a = int(input('Введите год: '))

# вариант 1
if a % 4 == 0  and a % 100 != 0 or a % 400 == 0:
    print('YES')
else:
    print('NO')

# вариант 2 (тернарный оператор - условный оператор в одну строку)
print('YES'if a % 4 == 0  and a % 100 != 0 or a % 400 == 0 else 'NO')

# вариант 3 (ложь или истина)
print(a % 4 == 0  and a % 100 != 0 or a % 400 == 0)