# Напишите программу для печати всех уникальных 
# значений в словаре. 
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, 
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII 
# ":" S007 "}] 
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально. 
# Пользователь его не вводит

d = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {" V ":" S009 "}, {" VIII ":" S007 "}]
d_new = set()

for i in d:
    for k in i:
        d_new.add(i[k])
    
print(d_new)

# вариант 2

d2 = []

for dck in d:
    for i in dck:
        d2.append(dck[i])
print(set(d2))

# вариант 3
d_new = set()
for el in d:
    d_new.add(*el.values()) # функция распаковки объекта
print(d_new)